export function ltfKnowledge() {
  return `
  <ltf-knowledge>
    - กองทุนรวมหุ้นระยะยาว ” LTF “ ย่อมาจาก Long Term Equity Fund
    - นโยบายการลงทุน - เป็นกองทุนรวมที่ลงทุนในหุ้นไม่น้อยกว่า  65% ความเสี่ยงระดับ 6 (ค่อนข้างสูงเพราะเน้นลงทุนในหุ้น) มีทั้งกองแบบที่จ่ายเงินปันผล และไม่จ่ายเงินปันผล โดยจะเน้นการลงทุนในประเทศเท่านั้น
    - เงื่อนไขการลงทุน LTF
        - ปัจจุบันไม่สามารถซื้อ LTF ได้แล้ว โดยปี 2562 เป็นปีสุดท้าย
        - ไม่จำกัดเงินลงทุนขั้นต่ำ เงินลงทุนสูงสุดไม่เกิน 15% ของเ
        งินได้และ ไม่เกิน 500,000 บ. (ไม่นับรวม RMF ประกันบำนาญ กองทุนสำรองเลี้ยงชีพ ประกันบำนาญ กองทุนสงเคราะห์ตามกฎหมายโรงเรียนเอกชน)
        - เงินลงทุน LTF ก่อนวันที่ 1 มกราคม 2559 ต้องถือครอง 5 ปีปฏิทินเป็นอย่างต่ำ
        - เงินลงทุน LTF ตั้งแต่วันที่ 1 มกราคม 2559 ต้องถือครอง 7 ปีปฏิทินเป็นอย่างต่ำ (โดยนับปีชนปี)
        - เงื่อนไขถือครองกองทุน LTF 7 ปีปฏิทิน ตามเกณฑ์ปี 2559 ถึงปี 2562
            - ถ้าซื้อ LTF ลดหย่อนภาษีปี 2559 ถือครบ 7 ปีปฏิทิน จะสามารถขายหน่วยออกได้ในปี 2565
            - ถ้าซื้อ LTF ลดหย่อนภาษีปี 2560 ถือครบ 7 ปีปฏิทิน จะสามารถขายหน่วยออกได้ในปี 2566
            - ถ้าซื้อ LTF ลดหย่อนภาษีปี 2561 ถือครบ 7 ปีปฏิทิน จะสามารถขายหน่วยออกได้ในปี 2567
            - ถ้าซื้อ LTF ลดหย่อนภาษีปี 2562 ถือครบ 7 ปีปฏิทิน จะสามารถขายหน่วยออกได้ในปี 2568
  </ltf-knowledge>
  `;
}
