// This is simulation of getting config from https://docs.google.com/spreadsheets/d/1FXn5lJXCPIiYXlstZ3apV2wN0umaRIbBR1zCh337xSw/edit?usp=sharing

function getConfig() {
  return {
    fundQuote: {
      baseUrl: 'https://www.finnomena.com/fund/',
    },
    fundApi: {
      baseUrl: 'https://api-int.finnomena.com/fund-service/public/api/v2/funds',
    },
    tsf: {
      portfolio: [
        {
          type: 'rmf',
          risk: 'high',
          fund: 'KKP GNP RMF-UH',
          proportion: 40,
        },
        {
          type: 'rmf',
          risk: 'high',
          fund: 'B-INNOTECHRMF',
          proportion: 30,
        },
        {
          type: 'rmf',
          risk: 'high',
          fund: 'PRINCIPAL VNEQRMF',
          proportion: 30,
        },
        {
          type: 'rmf',
          risk: 'medium',
          fund: 'UGISRMF',
          proportion: 40,
        },
        {
          type: 'rmf',
          risk: 'medium',
          fund: 'KKP GNP RMF-UH',
          proportion: 30,
        },
        {
          type: 'rmf',
          risk: 'medium',
          fund: 'B-INNOTECHRMF',
          proportion: 30,
        },
        {
          type: 'rmf',
          risk: 'low',
          fund: 'UGBFRMF',
          proportion: 40,
        },
        {
          type: 'rmf',
          risk: 'low',
          fund: 'UGISRMF',
          proportion: 30,
        },
        {
          type: 'rmf',
          risk: 'low',
          fund: 'KKP INRMF',
          proportion: 30,
        },
        {
          type: 'rmf',
          risk: 'safe',
          fund: 'UGISRMF',
          proportion: 50,
        },
        {
          type: 'rmf',
          risk: 'safe',
          fund: 'KKP INRMF',
          proportion: 50,
        },
        {
          type: 'ssf',
          risk: 'high',
          fund: 'KKP GNP-SSF',
          proportion: 40,
        },
        {
          type: 'ssf',
          risk: 'high',
          fund: 'B-INNOTECHSSF',
          proportion: 30,
        },
        {
          type: 'ssf',
          risk: 'high',
          fund: 'K-VIETNAM-SSF',
          proportion: 30,
        },
        {
          type: 'ssf',
          risk: 'medium',
          fund: 'UGIS-SSF',
          proportion: 40,
        },
        {
          type: 'ssf',
          risk: 'medium',
          fund: 'KKP GNP-SSF',
          proportion: 30,
        },
        {
          type: 'ssf',
          risk: 'medium',
          fund: 'B-INNOTECHSSF',
          proportion: 30,
        },
        {
          type: 'ssf',
          risk: 'low',
          fund: 'UGBF-SSF',
          proportion: 40,
        },
        {
          type: 'ssf',
          risk: 'low',
          fund: 'UGIS-SSF',
          proportion: 30,
        },
        {
          type: 'ssf',
          risk: 'low',
          fund: 'KKP ACT FIXED-SSF',
          proportion: 30,
        },
        {
          type: 'ssf',
          risk: 'safe',
          fund: 'UGIS-SSF',
          proportion: 50,
        },
        {
          type: 'ssf',
          risk: 'safe',
          fund: 'KKP ACT FIXED-SSF',
          proportion: 50,
        },
        {
          type: 'tesg',
          risk: 'high',
          fund: 'ASP-ThaiESG',
          proportion: 100,
        },
        {
          type: 'tesg',
          risk: 'medium',
          fund: 'KTAG70/30-ThaiESG',
          proportion: 100,
        },
        {
          type: 'tesg',
          risk: 'low',
          fund: 'KKP GB THAI ESG',
          proportion: 100,
        },
        {
          type: 'tesg',
          risk: 'safe',
          fund: 'KKP GB THAI ESG',
          proportion: 100,
        },
      ],
      recommendedFund: [
        {
          type: 'ssf',
          risk: 'high',
          fund: 'KKP GNP-SSF',
          category: 'หุ้นโลก',
          fund_comment:
            'ลงทุนในกองทุนหลัก Capital Group - New Perspective Fund โดยกองทุนหลักลงทุนในหุ้นสามัญทั่วโลกของบริษัทที่มีส่วนร่วมกับการเปลี่ยนแปลงด้านการค้าและเศรษฐกิจระหว่างประเทศของโลกในอนาคต ผลตอบแทนของกองทุนมีความสัมพันธ์กับผลตอบแทนของหุ้นโลก (เทียบจากดัชนี MSCI ACWI) ในระยะยาว กองทุนนี้มีสไตล์การลงทุนที่สร้าง Alpha ในระยะยาวได้เหนือดัชนีชี้วัดต่อเนื่อง ในขณะเดียวกันก็รักษาความผันผวนของพอร์ตให้ไม่สูงเกินไป โดยกองทุนนี้บริหารด้วยกลยุทธ์ที่มีมากว่า 50 ปี และทีมผู้จัดการกองทุนขนาดใหญ่ที่มีประสบการณ์สูง เน้นการลงทุนในระยะยาว มี portfolio turnover โดยเฉลี่ยอยู่ที่ 25% ซึ่งถือว่าค่อนข้างต่ำ และมีหุ้นกว่า 60% ที่ถือครองมาแล้วนานกว่า 5 ปี กองทุนมีการเลือกหุ้นแบบ Bottom-up ในแต่ละอุตสาหกรรม ไม่ได้มี High Conviction มากเกินไปจนทำให้กองทุนมีการลงทุนในแต่ละอุตสาหกรรมผิดเพี้ยนไปจากดัชนีอ้างอิง ทำให้ได้ Alpha มาจากการเลือกหุ้นที่เป็นผู้ชนะในตลาดจริง ๆ\n\nกองทุน feeder ในไทยไม่มีการป้องกันความเสี่ยงค่าเงิน ซึ่งในระยะสั้นช่วยลดต้นทุนการป้องกันความเสี่ยงค่าเงินที่ปัจจุบันอยู่ในระยะดับสูงได้ ในระยะยาวการเปิดความเสี่ยงค่าเงินอาจมีช่วยลดความผันผวนต่อการลงทุนได้สำหรับการลงทุนในกองทุนหุ้น แม้ค่าเงินจะมีความผันผวน แต่ในอดีตที่ผ่านมา ความสัมพันธ์ระหว่างทิศทางของค่าเงิน USD กับทิศทางราคาหุ้นโลกมักจะสวนทางการในสภาวะที่ตลาดหุ้นเกิดการปรับตัวจาก risk off ในสินทรัพย์เสี่ยง',
        },
        {
          type: 'ssf',
          risk: 'high',
          fund: 'B-INNOTECHSSF',
          category: 'หุ้นเทคโนโลยี',
          fund_comment:
            'ลงทุนในกองทุนหลัก Fidelity Funds - Global Technology ซึ่งลงทุนในหุ้นเทคโนโลยีทั่วโลก บริหารโดยผู้จัดการกองทุน Hyun Ho Sohn ที่บริหารกองทุนนี้มีกว่า 11 ปี และร่วมงานกับ Fidelity มากว่า 18 ปี คัดเลือกหุ้นแบบ bottom-up เลือกหุ้นเติบโตที่มีมูลค่าไม่แพงเกินไป จัดออกมาเป็นพอร์ตการลงทุนหุ้นเทคโนโลยีที่มี P/E ratio ต่ำ มีความผันผวนไม่สูงเมื่อเทียบกับกองทุนหุ้นเทคโนโลยีอื่น ๆ เหมาะกับการลงทุนในระยะยาว \nกองทุนหลักมีการลงทุนเพื่อให้ล้อไปกับกระแสด้านปัญญาประดิษฐ์​ (Artificial Intelligence) โดยลงทุนในหุ้นที่มีส่วนร่วมในการใช้งาน AI แต่อาจไม่ได้เป็นหุ้นที่อยู่ในกระแสของนักลงทุนในแต่ละช่วงเวลา ทำให้ในระยะสั้นกองทุนอาจทำผลตอบแทนได้ต่ำกว่ากองทุนหุ้นเทคโนโลยีกองอื่น ๆ แต่ในระยะยาว กองทุนนี้ทำผลตอบแทนได้อย่างโดดเด่นนับตั้งแต่จัดตั้งกองทุน',
        },
        {
          type: 'ssf',
          risk: 'high',
          fund: 'KT-HEALTHCARE-SSF',
          category: 'หุ้น Healthcare',
          fund_comment:
            'ลงทุนในกองทุนหลัก Janus Henderson Global Life Sciences Fund ซึ่งลงทุนในหุ้นกลุ่มอุตสาหกรรมสุขภาพทั่วโลก บริหารกองทุนโดยผู้จัดการกองทุนที่มีประวัติการศึกษาในสายวิทยาศาสตร์สุขภาพ และมีประวัติการบริหารกองทุนหุ้นกลุ่ม healthcare มานานกว่า 20 ปี กองทุนหลักลงทุนในหุ้นกลุ่มอุตสาหกรรม และมีผลการดำเนินงานที่โดดเด่นตั้งแต่จัดตั้งกองทุน กองทุนหลักลงทุนในหุ้นในกลุ่มอุตสาหกรรมสุขภาพในหลากหลายธีม เช่น บริษัทผู้ผลิตยา บริษัทที่ทำธุรกิจไบโอเทคโนโลยี บริษัทผู้ให้บริการด้านประกันสุขภาพ และมีการปรับเปลี่ยนสัดส่วนให้เหมาะสมอยู่เสมอ',
        },
        {
          type: 'ssf',
          risk: 'high',
          fund: 'AFMOAT-HSSF',
          category: 'หุ้นสหรัฐฯ',
          fund_comment:
            'กองทุนหุ้นสหรัฐฯ แบบเน้นหุ้นคุณค่า ลงทุนในกองทุนหลัก VanEck Morningstar Wide Moat ETF เน้นลงทุนในธุรกิจที่มีความสามารถในการแข่งขันอย่างยั่งยืน ถูก disrupt จากคู่แข่งได้ยาก ทำให้เป็นผู้นำในอุตสาหกรรม ตัว ETF มีการควบคุมความเสี่ยงด้วยวิธีการเชิง Valuation และการกระจายน้ำหนักลงทุนแบบให้น้ำหนักรายหุ้นเท่ากัน (equal weight) ช่วยให้ความเสี่ยงของพอร์ตอยู่ในระดับต่ำ จากการหลีกเลี่ยงลงทุนในหุ้นที่แพงมากเกินไป ผลตอบแทนในระยะยาว เหนือดัชนีเปรียบเทียบอย่าง S&P500 จากการรักษา drawdown ให้ต่ำ และได้ผลตอบแทนที่ดีในช่วงตลาดขาขึ้น',
        },
        {
          type: 'ssf',
          risk: 'high',
          fund: 'B-USALPHASSF',
          category: 'หุ้นสหรัฐฯ',
          fund_comment:
            'กองทุนหุ้นสหรัฐฯ สายเติบโต ลงทุนในกองทุนหลัก JPMorgan Funds - US Growth Fund ซึ่งเน้นลงทุนเอาชนะดัชนี Russell 1000 Growth ซึ่งเป็นดัชนีชี้วัดหุ้นเติบโตในสหรัฐฯ โดยเน้นคัดเลือกหุ้นระหว่าง 60-80 บริษัท และมีการพิจารณาเรื่อง Price Momentum เพื่อที่จะทำให้การลงทุนมีความสามารถในการ Capture Upside ได้ดีในช่วงตลาดขาขึ้น และบริหาร Downside ได้อย่างมีประสิทธิภาพในช่วงตลาดเป็นขาลง และยังมีทีมบริหารที่มีประสบการณ์สูงและมีประสบการณ์ในการทำกลยุทธ์มาตั้งแต่ปี 2005 เและเมื่อเทียบผลการดำเนินงานของกองทุนหลักกับ Peer ในกลุ่ม US Large-Cap Growth ด้วยกันถือว่าโดดเด่นอย่างมาก',
        },
        {
          type: 'ssf',
          risk: 'high',
          fund: 'B-ASIASSF',
          category: 'หุ้นตลาดเกิดใหม่เอเชีย',
          fund_comment:
            'ลงทุนในกองทุนหลัก Invesco Asian Equity Fund ลงทุนในหุ้นของบริษัทที่จดทะเบียนในภูมิภาคเอเชียที่ไม่รวมประเทศญี่ปุ่น ออสเตรเลีย และนิวซีแลนด์ กองทุนมีลักษณะบริหารแบบเชิกรุก (Active) โดย Invesco เน้นลงทุนในหุ้นเอเชียที่มีขนาดใหญ่ มีสภาพคล่องสูง ด้วยความเชี่ยวชาญของพันธมิตรระดับโลกรายนี้ ทำให้ช่วยแบ่งปันมุมมองและฉายภาพการลงทุนให้เห็นได้กว้างไกลมากขึ้น นำไปสู่กลยุทธ์กระจายพอร์ตลงทุนแบบมืออาชีพ ที่บางจังหวะได้เพิ่มน้ำหนักการลงทุนในหุ้นเอเชียบางตลาดที่หลายคนมองข้าม (Contrarian) \nกองทุนทำผลงานในอดีตได้ดีกว่าดัชนีชี้วัด (Benchmark) นับตั้งแต่จัดตั้งกองทุน',
        },
        {
          type: 'ssf',
          risk: 'high',
          fund: 'SCBMLCA(SSF)',
          category: 'หุ้นจีน',
          fund_comment:
            'กองทุนบริหารโดย บลจ. ไทยพาณิชย์ (SCBAM) สามารถเลือกลงทุนหุ้นจีนได้ทุกตลาด คัดเลือกหุ้นด้วยการใช้ Machine Learning โดยใช้ข้อมูลหลากหลายมิติ เช่นข้อมูลงบการเงิน, ผลตอบแทนย้อนหลัง เพื่อคัดเลือกหุ้นที่มีแนวโน้มเติบโต จากนั้นใช้การทำ Portfolio Optimization เพื่อควบคุมความผันผวน และควบคุม Tracking Error ของพอร์ตให้ไม่หนีจากดัชนีชี้วัดมากเกินไป กองทุนนี้มีการป้องกันความเสี่ยงค่าเงินแบบ active ระหว่างสกุลเงินบาทและสกุลเงินที่ลงทุน (ดอลลาร์ฮ่องกงหรือหยวน) ซึ่งจะทำให้ได้ประโยชน์ในระยะยาวจากการมีต้นทุนป้องกันความเสี่ยงค่าเงินที่ต่ำกว่ากองทุน RMF/SSF หุ้นจีนกองอื่นที่มีการป้องกันความเสี่ยงคู่ค่าเงิน USD/THB จากการลงทุนในกองทุนหลักในสกุลเงินดอลลาร์สหรัฐฯ',
        },
        {
          type: 'ssf',
          risk: 'high',
          fund: 'K-VIETNAM-SSF',
          category: 'หุ้นเวียดนาม',
          fund_comment:
            'ลงทุนในหุ้นที่จดทะเบียนในตลาดหลักทรัพย์ในประเทศเวียดนาม ที่ดำเนินธุรกิจหรือได้รับผลประโยชน์จากการเติบโตทางเศรษฐกิจ หรือมีทรัพย์สินส่วนใหญ่มาจากการเติบโตทางเศรษฐกิจของประเทศเวียดนาม บริหารกองทุนโดยทีมผู้จัดการกองทุนชาวไทยที่มีประสบการณ์ ลดการเสียค่าธรรมเนียมหลายต่อจากการลงทุนผ่าน Feeder Fund กองทุนนี้สามารถสร้างผลตอบแทนได้เป็นลำดับต้น ๆ ของกองทุนเวียดนามในไทย ช่วง 3 ปีที่ผ่านมา และมีค่าธรรมเนียมไม่แพง',
        },
        {
          type: 'ssf',
          risk: 'high',
          fund: 'ASP-SME-SSF',
          category: 'หุ้นไทย',
          fund_comment:
            'กองทุนหุ้นไทยบริหารโดยผู้จัดการกองทุนมากประสบการณ์ในสายการลงทุนหุ้นไทยขนาดกลางเล็ก โดยกองทุนเน้นลงทุนในบริษัทขนาดกลางและขนาดเล็ก ทั้งที่จดทะเบียนในตลาดหลักทรัพย์แห่งประเทศไทย (SET) ตลาดหลักทรัพย์ เอ็ม เอ ไอ (mai) รวมถึงการจองซื้อตั้งแต่ช่วง IPO โดยมีกลยุทธ์การคัดเลือกหุ้นจะเน้นที่การวิเคราะห์ตัวบริษัทแบบ Bottom-Up เพื่อเลือกหุ้นปัจจัยพื้นฐานดี และมีแนวโน้มเติบโตระยะยาว ภายใต้เงื่อนไขว่าจะต้องมีมูลค่าหลักทรัพย์ (Market Cap.) ไม่เกิน 80,000 ล้านบาท ก่อนวันเข้าลงทุน ปรัชญาการลงทุนของ ASP-SME-A เชื่อว่าหุ้นขนาดกลางและขนาดเล็กที่มีศักยภาพ จะมีโอกาสสร้างผลตอบแทนแบบก้าวกระโดดได้มากกว่าหุ้นขนาดใหญ่ จากการขยายตัวของธุรกิจและการควบรวมกิจการ ประกอบกับการที่นักลงทุนสนใจน้อย จึงมี Valuation น่าสนใจ',
        },
        {
          type: 'ssf',
          risk: 'high',
          fund: 'SCHGOLDH-SSF',
          category: 'ทองคำ',
          fund_comment:
            'กองทุนเน้นลงทุนในกองทุนหลัก SPDR Gold Trust ซึ่งเป็นกองทุนที่มีการซื้อขายและถือทองคำมากที่สุดในโลก กองทุนไม่ป้องกันความเสี่ยงอัตราแลกเปลีี่ยนทำให้ทิศทางของราคากองทุนสอดคล้องกับราคาทองแท่งในสกุลบาท',
        },
        {
          type: 'ssf',
          risk: 'medium',
          fund: 'UGBF-SSF',
          category: 'สินทรัพย์ผสม',
          fund_comment:
            'กองทุนลงทุนในกองทุนหลัก JPM Global Balanced C (acc) - USD (hedged) ซึ่งบริหารโดยผู้จัดการกองทุนที่มีประสบการณ์ทั้งในองค์กรและในอุตสาหกรรมเฉลี่ยมากกว่า 20 ปี โดยกองทุนจะเน้นไปที่การจัดพอร์ตประเภท 50/50 (หุ้นทั่วโลก 50% และตราสารหนี้ทั่วโลก 50%) ซึ่งสามารถเอาชนะตลาดได้ในระยะยาวเมื่อเทียบกับดัชนีชี้วัด และมีผลตอบแทนโดดเด่นเหนือกว่ากองทุนอื่น ๆ ในประเภทเดียวกัน',
        },
        {
          type: 'ssf',
          risk: 'low',
          fund: 'UGIS-SSF',
          category: 'ตราสารหนี้โลก',
          fund_comment:
            'กองทุนรวมตราสารหนี้ทั่วโลก ลงทุนแบบเชิงรุก เพื่อสร้างผลตอบแทนเป็นรายได้ที่สม่ำเสมอ จุดเด่น บริหารแบบ Active ปรับสัดส่วนให้เหมาะสมกับสถานการณ์ ผลตอบแทนย้อนหลังเอาชนะดัชนีเปรียบเทียบได้สม่ำเสมอ ภายใต้ความผันผวนที่ต่ำ บริหารโดย PIMCO บลจ. เฉพาะด้านตราสารหนี้ทั่วโลก',
        },
        {
          type: 'ssf',
          risk: 'low',
          fund: 'KKP ACT FIXED-SSF',
          category: 'ตราสารหนี้ไทย',
          fund_comment:
            'เป็นกองทุนตราสารหนี้ที่เน้นลงทุนในตราสารหนี้ทั้งในและต่างประเทศ ทั้งประเภทเงินฝาก ตราสารหนี้ภาครัฐ ตราสารหนี้ภาคเอกชน ซึ่งพิจารณาในเรื่องของพื้นฐานของตราสารหนี้ที่ดี มีฐานะการเงินที่ดีและมีสภาพคล่อง กองทุนมีผลการดำเนินงานที่โดดเด่น  บริหารงานโดยผู้จัดการกองทุนมากประสบการณ์ที่เคยได้รับรางวัล Morningstar Awards ถึง 2 ปีซ้อน เน้นการบริหารจัดการแบบ Dynamic ซึ่งจะเป็นการปรับอายุเฉลี่ยของตราสารหนี้ในกองทุนให้เหมาะสมกับสภาวะตลาด และคัดเลือกตราสารหนี้ภาคเอกชนด้วยความเสี่ยงที่เหมาะสม',
        },
        {
          type: 'rmf',
          risk: 'high',
          fund: 'KKP GNP RMF-UH',
          category: 'หุ้นโลก',
          fund_comment:
            'ลงทุนในกองทุนหลัก Capital Group - New Perspective Fund โดยกองทุนหลักลงทุนในหุ้นสามัญทั่วโลกของบริษัทที่มีส่วนร่วมกับการเปลี่ยนแปลงด้านการค้าและเศรษฐกิจระหว่างประเทศของโลกในอนาคต ผลตอบแทนของกองทุนมีความสัมพันธ์กับผลตอบแทนของหุ้นโลก (เทียบจากดัชนี MSCI ACWI) ในระยะยาว กองทุนนี้มีสไตล์การลงทุนที่สร้าง Alpha ในระยะยาวได้เหนือดัชนีชี้วัดต่อเนื่อง ในขณะเดียวกันก็รักษาความผันผวนของพอร์ตให้ไม่สูงเกินไป โดยกองทุนนี้บริหารด้วยกลยุทธ์ที่มีมากว่า 50 ปี และทีมผู้จัดการกองทุนขนาดใหญ่ที่มีประสบการณ์สูง เน้นการลงทุนในระยะยาว มี portfolio turnover โดยเฉลี่ยอยู่ที่ 25% ซึ่งถือว่าค่อนข้างต่ำ และมีหุ้นกว่า 60% ที่ถือครองมาแล้วนานกว่า 5 ปี กองทุนมีการเลือกหุ้นแบบ Bottom-up ในแต่ละอุตสาหกรรม ไม่ได้มี High Conviction มากเกินไปจนทำให้กองทุนมีการลงทุนในแต่ละอุตสาหกรรมผิดเพี้ยนไปจากดัชนีอ้างอิง ทำให้ได้ Alpha มาจากการเลือกหุ้นที่เป็นผู้ชนะในตลาดจริง ๆ\n\nกองทุน feeder ในไทยไม่มีการป้องกันความเสี่ยงค่าเงิน ซึ่งในระยะสั้นช่วยลดต้นทุนการป้องกันความเสี่ยงค่าเงินที่ปัจจุบันอยู่ในระยะดับสูงได้ ในระยะยาวการเปิดความเสี่ยงค่าเงินอาจมีช่วยลดความผันผวนต่อการลงทุนได้สำหรับการลงทุนในกองทุนหุ้น แม้ค่าเงินจะมีความผันผวน แต่ในอดีตที่ผ่านมา ความสัมพันธ์ระหว่างทิศทางของค่าเงิน USD กับทิศทางราคาหุ้นโลกมักจะสวนทางการในสภาวะที่ตลาดหุ้นเกิดการปรับตัวจาก risk off ในสินทรัพย์เสี่ยง',
        },
        {
          type: 'rmf',
          risk: 'high',
          fund: 'B-INNOTECHRMF',
          category: 'หุ้นเทคโนโลยี',
          fund_comment:
            'ลงทุนในกองทุนหลัก Fidelity Funds - Global Technology ซึ่งลงทุนในหุ้นเทคโนโลยีทั่วโลก บริหารโดยผู้จัดการกองทุน Hyun Ho Sohn ที่บริหารกองทุนนี้มีกว่า 11 ปี และร่วมงานกับ Fidelity มากว่า 18 ปี คัดเลือกหุ้นแบบ bottom-up เลือกหุ้นเติบโตที่มีมูลค่าไม่แพงเกินไป จัดออกมาเป็นพอร์ตการลงทุนหุ้นเทคโนโลยีที่มี P/E ratio ต่ำ มีความผันผวนไม่สูงเมื่อเทียบกับกองทุนหุ้นเทคโนโลยีอื่น ๆ เหมาะกับการลงทุนในระยะยาว \nกองทุนหลักมีการลงทุนเพื่อให้ล้อไปกับกระแสด้านปัญญาประดิษฐ์​ (Artificial Intelligence) โดยลงทุนในหุ้นที่มีส่วนร่วมในการใช้งาน AI แต่อาจไม่ได้เป็นหุ้นที่อยู่ในกระแสของนักลงทุนในแต่ละช่วงเวลา ทำให้ในระยะสั้นกองทุนอาจทำผลตอบแทนได้ต่ำกว่ากองทุนหุ้นเทคโนโลยีกองอื่น ๆ แต่ในระยะยาว กองทุนนี้ทำผลตอบแทนได้อย่างโดดเด่นนับตั้งแต่จัดตั้งกองทุน',
        },
        {
          type: 'rmf',
          risk: 'high',
          fund: 'SCBRMGHC',
          category: 'หุ้น Healthcare',
          fund_comment:
            'ลงทุนในกองทุนหลัก Janus Henderson Global Life Sciences Fund ซึ่งลงทุนในหุ้นกลุ่มอุตสาหกรรมสุขภาพทั่วโลก บริหารกองทุนโดยผู้จัดการกองทุนที่มีประวัติการศึกษาในสายวิทยาศาสตร์สุขภาพ และมีประวัติการบริหารกองทุนหุ้นกลุ่ม healthcare มานานกว่า 20 ปี กองทุนหลักลงทุนในหุ้นกลุ่มอุตสาหกรรม และมีผลการดำเนินงานที่โดดเด่นตั้งแต่จัดตั้งกองทุน กองทุนหลักลงทุนในหุ้นในกลุ่มอุตสาหกรรมสุขภาพในหลากหลายธีม เช่น บริษัทผู้ผลิตยา บริษัทที่ทำธุรกิจไบโอเทคโนโลยี บริษัทผู้ให้บริการด้านประกันสุขภาพ และมีการปรับเปลี่ยนสัดส่วนให้เหมาะสมอยู่เสมอ',
        },
        {
          type: 'rmf',
          risk: 'high',
          fund: 'AFMOATHRMF',
          category: 'หุ้นสหรัฐฯ',
          fund_comment:
            'กองทุนหุ้นสหรัฐฯ แบบเน้นหุ้นคุณค่า ลงทุนในกองทุนหลัก VanEck Morningstar Wide Moat ETF เน้นลงทุนในธุรกิจที่มีความสามารถในการแข่งขันอย่างยั่งยืน ถูก disrupt จากคู่แข่งได้ยาก ทำให้เป็นผู้นำในอุตสาหกรรม ตัว ETF มีการควบคุมความเสี่ยงด้วยวิธีการเชิง Valuation และการกระจายน้ำหนักลงทุนแบบให้น้ำหนักรายหุ้นเท่ากัน (equal weight) ช่วยให้ความเสี่ยงของพอร์ตอยู่ในระดับต่ำ จากการหลีกเลี่ยงลงทุนในหุ้นที่แพงมากเกินไป ผลตอบแทนในระยะยาว เหนือดัชนีเปรียบเทียบอย่าง S&P500 จากการรักษา drawdown ให้ต่ำ และได้ผลตอบแทนที่ดีในช่วงตลาดขาขึ้น',
        },
        {
          type: 'rmf',
          risk: 'high',
          fund: 'B-USALPHARMF',
          category: 'หุ้นสหรัฐฯ',
          fund_comment:
            'กองทุนหุ้นสหรัฐฯ สายเติบโต ลงทุนในกองทุนหลัก JPMorgan Funds - US Growth Fund ซึ่งเน้นลงทุนเอาชนะดัชนี Russell 1000 Growth ซึ่งเป็นดัชนีชี้วัดหุ้นเติบโตในสหรัฐฯ โดยเน้นคัดเลือกหุ้นระหว่าง 60-80 บริษัท และมีการพิจารณาเรื่อง Price Momentum เพื่อที่จะทำให้การลงทุนมีความสามารถในการ Capture Upside ได้ดีในช่วงตลาดขาขึ้น และบริหาร Downside ได้อย่างมีประสิทธิภาพในช่วงตลาดเป็นขาลง และยังมีทีมบริหารที่มีประสบการณ์สูงและมีประสบการณ์ในการทำกลยุทธ์มาตั้งแต่ปี 2005 เและเมื่อเทียบผลการดำเนินงานของกองทุนหลักกับ Peer ในกลุ่ม US Large-Cap Growth ด้วยกันถือว่าโดดเด่นอย่างมาก',
        },
        {
          type: 'rmf',
          risk: 'high',
          fund: 'B-ASIARMF',
          category: 'หุ้นตลาดเกิดใหม่เอเชีย',
          fund_comment:
            'ลงทุนในกองทุนหลัก Invesco Asian Equity Fund ลงทุนในหุ้นของบริษัทที่จดทะเบียนในภูมิภาคเอเชียที่ไม่รวมประเทศญี่ปุ่น ออสเตรเลีย และนิวซีแลนด์ กองทุนมีลักษณะบริหารแบบเชิกรุก (Active) โดย Invesco เน้นลงทุนในหุ้นเอเชียที่มีขนาดใหญ่ มีสภาพคล่องสูง ด้วยความเชี่ยวชาญของพันธมิตรระดับโลกรายนี้ ทำให้ช่วยแบ่งปันมุมมองและฉายภาพการลงทุนให้เห็นได้กว้างไกลมากขึ้น นำไปสู่กลยุทธ์กระจายพอร์ตลงทุนแบบมืออาชีพ ที่บางจังหวะได้เพิ่มน้ำหนักการลงทุนในหุ้นเอเชียบางตลาดที่หลายคนมองข้าม (Contrarian) \nกองทุนทำผลงานในอดีตได้ดีกว่าดัชนีชี้วัด (Benchmark) นับตั้งแต่จัดตั้งกองทุน',
        },
        {
          type: 'rmf',
          risk: 'high',
          fund: 'SCBRMMLCA',
          category: 'หุ้นจีน',
          fund_comment:
            'กองทุนบริหารโดย บลจ. ไทยพาณิชย์ (SCBAM) สามารถเลือกลงทุนหุ้นจีนได้ทุกตลาด คัดเลือกหุ้นด้วยการใช้ Machine Learning โดยใช้ข้อมูลหลากหลายมิติ เช่นข้อมูลงบการเงิน, ผลตอบแทนย้อนหลัง เพื่อคัดเลือกหุ้นที่มีแนวโน้มเติบโต จากนั้นใช้การทำ Portfolio Optimization เพื่อควบคุมความผันผวน และควบคุม Tracking Error ของพอร์ตให้ไม่หนีจากดัชนีชี้วัดมากเกินไป กองทุนนี้มีการป้องกันความเสี่ยงค่าเงินแบบ active ระหว่างสกุลเงินบาทและสกุลเงินที่ลงทุน (ดอลลาร์ฮ่องกงหรือหยวน) ซึ่งจะทำให้ได้ประโยชน์ในระยะยาวจากการมีต้นทุนป้องกันความเสี่ยงค่าเงินที่ต่ำกว่ากองทุน RMF/SSF หุ้นจีนกองอื่นที่มีการป้องกันความเสี่ยงคู่ค่าเงิน USD/THB จากการลงทุนในกองทุนหลักในสกุลเงินดอลลาร์สหรัฐฯ',
        },
        {
          type: 'rmf',
          risk: 'high',
          fund: 'B-INDIARMF',
          category: 'หุ้นอินเดีย',
          fund_comment:
            'ลงทุนในกองทุนหลัก Kotak Funds - India Midcap Fund ซึ่งเน้นไปที่หุ้นของบริษัทที่จดทะเบียนในตลาดหุ้นอินเดีย แต่จะเน้นไปที่ขนาดกลางเป็นส่วนใหญ่เพื่อรับอานิสงค์กลุ่ม Middle-Class ที่กำลังเติบโตในประเทศ ทั้งนี้กองทุนหลักมีผลการดำเนินงานที่โดดเด่นมากว่า 10 ปี และกองทุน B-INDIARMF มีนโยบายการบริหาร FX Heding Policy อย่าง Active ทำให้ผลการดำเนินงานส่งต่อมาได้อย่างเต็มที่ในระยะยาว',
        },
        {
          type: 'rmf',
          risk: 'high',
          fund: 'PRINCIPAL VNEQRMF',
          category: 'หุ้นโลก',
          fund_comment:
            'กองทุนทำการลงทุนในหลักทรัพย์ของเวียดนามโดยตรง ทั้งหุ้น และ ETF รายแรกของประเทศไทย พอร์ตกองทุนมีการจัดการและวิเคราะห์โดยผจก.กองทุนไทยและเวียดนามที่มีความเชี่ยวชาญ เลือกหุ้นและ Sector ที่มีโอกาสในการเติบโตระยะยาวและมีมูลค่าที่เหมาะสม รวมถึงมีการใช้กลยุทธ์ Core-Satellite Port เน้นผลตอบแทนระยะยาว และมีการสับเปลี่ยนหุ้นบางส่วนตามสภาวะตลาดเพื่อเพิ่มผลตอบแทนระยะสั้น',
        },
        {
          type: 'rmf',
          risk: 'high',
          fund: 'ASP-SMERMF',
          category: 'หุ้นไทย',
          fund_comment:
            'กองทุนหุ้นไทยบริหารโดยผู้จัดการกองทุนมากประสบการณ์ในสายการลงทุนหุ้นไทยขนาดกลางเล็ก โดยกองทุนเน้นลงทุนในบริษัทขนาดกลางและขนาดเล็ก ทั้งที่จดทะเบียนในตลาดหลักทรัพย์แห่งประเทศไทย (SET) ตลาดหลักทรัพย์ เอ็ม เอ ไอ (mai) รวมถึงการจองซื้อตั้งแต่ช่วง IPO โดยมีกลยุทธ์การคัดเลือกหุ้นจะเน้นที่การวิเคราะห์ตัวบริษัทแบบ Bottom-Up เพื่อเลือกหุ้นปัจจัยพื้นฐานดี และมีแนวโน้มเติบโตระยะยาว ภายใต้เงื่อนไขว่าจะต้องมีมูลค่าหลักทรัพย์ (Market Cap.) ไม่เกิน 80,000 ล้านบาท ก่อนวันเข้าลงทุน ปรัชญาการลงทุนของ ASP-SME-A เชื่อว่าหุ้นขนาดกลางและขนาดเล็กที่มีศักยภาพ จะมีโอกาสสร้างผลตอบแทนแบบก้าวกระโดดได้มากกว่าหุ้นขนาดใหญ่ จากการขยายตัวของธุรกิจและการควบรวมกิจการ ประกอบกับการที่นักลงทุนสนใจน้อย จึงมี Valuation น่าสนใจ',
        },
        {
          type: 'rmf',
          risk: 'medium',
          fund: 'UGBFRMF',
          category: 'สินทรัพย์ผสม',
          fund_comment:
            'กองทุนลงทุนในกองทุนหลัก JPM Global Balanced C (acc) - USD (hedged) ซึ่งบริหารโดยผู้จัดการกองทุนที่มีประสบการณ์ทั้งในองค์กรและในอุตสาหกรรมเฉลี่ยมากกว่า 20 ปี โดยกองทุนจะเน้นไปที่การจัดพอร์ตประเภท 50/50 (หุ้นทั่วโลก 50% และตราสารหนี้ทั่วโลก 50%) ซึ่งสามารถเอาชนะตลาดได้ในระยะยาวเมื่อเทียบกับดัชนีชี้วัด และมีผลตอบแทนโดดเด่นเหนือกว่ากองทุนอื่น ๆ ในประเภทเดียวกัน',
        },
        {
          type: 'rmf',
          risk: 'low',
          fund: 'UGISRMF',
          category: 'ตราสารหนี้โลก',
          fund_comment:
            'กองทุนรวมตราสารหนี้ทั่วโลก ลงทุนแบบเชิงรุก เพื่อสร้างผลตอบแทนเป็นรายได้ที่สม่ำเสมอ จุดเด่น บริหารแบบ Active ปรับสัดส่วนให้เหมาะสมกับสถานการณ์ ผลตอบแทนย้อนหลังเอาชนะดัชนีเปรียบเทียบได้สม่ำเสมอ ภายใต้ความผันผวนที่ต่ำ บริหารโดย PIMCO บลจ. เฉพาะด้านตราสารหนี้ทั่วโลก',
        },
        {
          type: 'rmf',
          risk: 'low',
          fund: 'KKP INRMF',
          category: 'ตราสารหนี้ไทย',
          fund_comment:
            'เป็นกองทุนตราสารหนี้ที่เน้นลงทุนในตราสารหนี้ทั้งในและต่างประเทศ ทั้งประเภทเงินฝาก ตราสารหนี้ภาครัฐ ตราสารหนี้ภาคเอกชน ซึ่งพิจารณาในเรื่องของพื้นฐานของตราสารหนี้ที่ดี มีฐานะการเงินที่ดีและมีสภาพคล่อง กองทุนมีผลการดำเนินงานที่โดดเด่น  บริหารงานโดยผู้จัดการกองทุนมากประสบการณ์ที่เคยได้รับรางวัล Morningstar Awards ถึง 2 ปีซ้อน เน้นการบริหารจัดการแบบ Dynamic ซึ่งจะเป็นการปรับอายุเฉลี่ยของตราสารหนี้ในกองทุนให้เหมาะสมกับสภาวะตลาด และคัดเลือกตราสารหนี้ภาคเอกชนด้วยความเสี่ยงที่เหมาะสม',
        },
        {
          type: 'rmf',
          risk: 'high',
          fund: 'BGOLDRMF',
          category: 'ทองคำ',
          fund_comment:
            'กองทุนเน้นลงทุนในกองทุนหลัก SPDR Gold Trust ซึ่งเป็นกองทุนที่มีการซื้อขายและถือทองคำมากที่สุดในโลก กองทุนไม่ป้องกันความเสี่ยงอัตราแลกเปลีี่ยนทำให้ทิศทางของราคากองทุนสอดคล้องกับราคาทองแท่งในสกุลบาท',
        },
        {
          type: 'tesg',
          risk: 'high',
          fund: 'ASP-ThaiESG',
          category: 'หุ้นไทย',
          fund_comment:
            'เน้นลงทุนในหุ้นจดทะเบียนใน SET และ/หรือ mai ที่ได้รับการคัดเลือกและยอมรับว่ามีความโดดเด่น ESG โดยจะเน้นการลงทุนในบริษัทที่มีการจัดอันดับ SET ESG Rating ต้ังแต่ BBB ขึ้นไป ที่จะลดปริมาณการปล่อยก๊าซเรือนกระจก ผ่าน SET ESG Data Platform โดยกองทุนมีผู้จัดการกองทุนคือคุณทิพย์วดี อภิชัยสิริ ซึ่งมีประสบการณ์ในการบริหารกองทุนหุ้นไทยที่โดดเด่นมาอย่างยาวนานผ่านกองทุน ASP-SME และบลจ. Asset Plus มีความเชี่ยวชาญในเรื่องของ Stock Selection ซึ่งเป็นจุดเด่นที่จะสามารถทำให้การบริหารจัดการกองทุนสามารถมีผลการดำเนินงานชนะตลาดได้ในระยะยาว',
        },
        {
          type: 'tesg',
          risk: 'medium',
          fund: 'KTAG70/30-ThaiESG',
          category: 'สินทรัพย์ผสม',
          fund_comment:
            'เน้นลงทุนลงทุนในหุ้นที่ผ่านการคัดเลือกและได้รับการประกาศผลประเมินหุ้นยั่งยืน SET ESG Ratings ของ SET ในระดับ A ขึ้นไป 70% และตราสารหนี้ประเภท Green Bond, Sustainability Bond และ Sustainability – Linked Bond อย่างใดอย่างหนึ่งหรือหลายอย่าง 30% โดยเน้นกลยุทธ์การลงทุนที่มุ่งหวังให้ผลประกอบการสูงกว่าดัชนีชี้วัด (Active Management) ทั้งในส่วนตราสารหนี้และตราสารทุน โดยผ่านกระบวนการวิเคราะห์การลงทุนแบบ ESG Integration และการวิเคราะห์ข้อมูลพื้นฐานรายบริษัทฯ แบบเชิงลึกจากฝ่ายวิจัยของ บลจ.',
        },
        {
          type: 'tesg',
          risk: 'low',
          fund: 'KKP GB THAI ESG',
          category: 'ตราสารหนี้',
          fund_comment:
            'กองทุนเน้นลงทุนในตราสารระยะยาว เพื่อสอดคล้องกับระยะเวลาในการลงทุนเพื่อลดหย่อนภาษี (ลงทุนอย่างน้อย 8 ปี) คาดการณ์อายุตราสารหนี้เฉลี่ยในพอร์ต 9 ปี และผลตอบแทนสุทธิของตราสารหนี้ที่ลงทุน 2.7-2.9% ต่อปี โดยผู้จัดการกองทุนมีประสบการณ์บริหารกองทุนตราสารหนี้ที่มีผลการดำเนินงานโดดเด่น และมีมุมมองการลงทุนที่เฉียบคม สร้างผลตอบแทนเทียบกับความเสี่ยงได้สม่ำเสมอ',
        },
      ],
      meta: [
        {
          key: 'combo_minimum_investment',
          value: 10000,
        },
        {
          key: 'ssf_below_minimum_fund',
          value: 'UGIS-SSF',
        },
        {
          key: 'rmf_below_minimum_fund',
          value: 'UGISRMF',
        },
        {
          key: 'tesg_below_minimum_fund',
          value: 'KKP GB THAI ESG',
        },
        {
          key: 'ssf_high_combo_description',
          value:
            'เสี่ยงสูง ลงทุนในหุ้น 100% แบ่งเป็นกองทุนหุ้นโลก กองทุนกลุ่มอุตสาหกรรม และกองทุนหุ้นเฉพาะประเทศ ที่ทั้งหมดล้วนมีโอกาสเติบโตในระยะยาว',
        },
        {
          key: 'ssf_medium_combo_description',
          value:
            'เสี่ยงปานกลาง กระจายการลงทุนตามหลักการ 60/40 ลงทุนในหุ้น 60% และตราสารหนี้ 40% ช่วยลดความผันผวนของพอร์ตให้ไม่สูงเกินไป',
        },
        {
          key: 'ssf_low_combo_description',
          value:
            'เสี่ยงต่ำ เน้นลงทุนในตราสารหนี้เป็นหลัก พร้อมกับเปิดโอกาสลงทุนในหุ้นผ่านกองทุนรวมผสม',
        },
        {
          key: 'ssf_safe_combo_description',
          value: 'เสี่ยงต่ำมาก ลงทุนในกองทุนรวมตราสารหนี้ 100%',
        },
        {
          key: 'rmf_high_combo_description',
          value:
            'เสี่ยงสูง ลงทุนในหุ้น 100% แบ่งเป็นกองทุนหุ้นโลก กองทุนกลุ่มอุตสาหกรรม และกองทุนหุ้นเฉพาะประเทศ ที่ทั้งหมดล้วนมีโอกาสเติบโตในระยะยาว',
        },
        {
          key: 'rmf_medium_combo_description',
          value:
            'เสี่ยงปานกลาง กระจายการลงทุนตามหลักการ 60/40 ลงทุนในหุ้น 60% และตราสารหนี้ 40% ช่วยลดความผันผวนของพอร์ตให้ไม่สูงเกินไป',
        },
        {
          key: 'rmf_low_combo_description',
          value:
            'เสี่ยงต่ำ เน้นลงทุนในตราสารหนี้เป็นหลัก พร้อมกับเปิดโอกาสลงทุนในหุ้นผ่านกองทุนรวมผสม',
        },
        {
          key: 'rmf_safe_combo_description',
          value: 'เสี่ยงต่ำมาก ลงทุนในกองทุนรวมตราสารหนี้ 100%',
        },
        {
          key: 'tesg_high_combo_description',
          value: 'เสี่ยงสูง ลงทุนในกองทุนรวมหุ้นไทย 100%',
        },
        {
          key: 'tesg_medium_combo_description',
          value:
            'เสี่ยงกลาง ลงทุนในกองทุนรวมผสม ซึ่งมีสัดส่วนการลงทุนในทั้งหุ้นไทยและตราสารหนี้ไทย',
        },
        {
          key: 'tesg_low_combo_description',
          value: 'เสี่ยงต่ำ ลงทุนในกองทุนรวมตราสารหนี้ไทย 100%',
        },
        {
          key: 'tesg_safe_combo_description',
          value: 'เสี่ยงต่ำ ลงทุนในกองทุนรวมตราสารหนี้ไทย 100%',
        },
        {
          key: 'db_version',
          value: 2024,
        },
      ],
    },
  };
}

export default getConfig();
